Repository: mozilla-l10n/mt-training-data
Catalog: dml/dml_pontoon.tmx
Source language: en_us
Languages: dml

source: Includes email, username & demographic info, available right away
dml: ای میل،استعمل کُرال ساں نم آں ڈیموگرافک معلوماتہ مشتمل درو،ژا دستیاب درو

source: Includes mp3s and related sentences, may take some time to prepare
dml: آmp3s آں متعلقہ جملہ نم شامل درو،کیدشی تیاریہ اچھک ٹیم گیو

source: Indonesian
dml: انڈونیشائی

source: Information about the language
dml: باݜہ تہ بارہ معلومات

source: In Progress
dml: جاری درو

source: Interested in getting involved with this project, or partnering with us?
dml: مینہ اما ملی یہ منصوبا شامل بینہ دلچسپی دورئی تا بہ اما ملی شراکت داری کُرن گٹینبئی?

source: Interested in learning more and contributing to the project?
dml: ورے ڇھیڇن آں پروجیکٹہ تعاون کُرن تہ دلچسپی درو

source: Interface language:
dml: انٹر فیس باݜہ

source: Interlingua
dml: انٹرلنگوا

source: Interlingue
dml: انٹرلنگو

source: [interrupted by background noise]
dml: ڈنگ پھچن بئیں تہ شور تہ وجہ روکاٹ

source: Intersex
dml: انٹر سیکس

source: Invalid file
dml: غلط فائل

source: Irish
dml: آئرش

source: IsiNdebele (North)
dml: IsiNdebele (شمالی)

source: IsiNdebele (South)
dml: IsiNdebele (جنوبی)

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
dml: <isoCodeLink>iso کوڈز</isoCodeLink> اگر پتہ درو بہ

source: Is the clip valid?
dml: کلپ سئی دروئی

source: Italian
dml: اٹالین

source: It contains words or phrases that are hard to read or pronounce.
dml: ئی منو الفاظ آں جملہ نم درو تے تسو مترن یا تلفظ ادا کُرن گرن درو

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
dml: ائی ڈیٹا سیٹ ساں میزبانی کُری 100تہ زیت باݜہ نم تہ کمیونٹی تہ پرئی کیرا ساں ساں انحصار اما ݜا درو۔ پلیٹ فام بہتر کُرنہ ہر کالہ ایک میلن ڈالر خرچہ آڅِنا

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. <strong>If you value open, inclusive data - donate today!</strong>
dml: ایک کالہ ڈیٹا سیٹ تہ میزبانی یہ ایک میلن تہ خرچہ آڅنا آں پلیٹ فام بہتر کُرئیں کی 100 تہ زیت باݜہ ویلا م کمیونٹی تے کیرا ساں انحصار ام ݜا درو۔<strong>اگر بی کولو آں جامع ڈیٹہ تہ قدر کُنبہ، تا مودئیں عطیہ کُرا</strong>

source: It costs a lot of money to continually host and release the datasets, improve the platform and run <africaMradiLink>community programmes</africaMradiLink>.
dml: ڈیٹا سیٹ ساں مسلسل میزبانی آں جاری کُرن،پلیٹ فام بہتر کُرن آں چلئیں کی لے زیت فںڈ تہ ضرورت درو آں چلن<africaMradiLink>کمیونٹی تہ پروگرم</africaMradiLink>

source: It is very important that all text sentences are <publicDomain>public domain</publicDomain> (cc0) as the Common Voice dataset is released under a cc0 license. Only ever upload a sentence if you are sure, and always include the relevant citation.
dml: یہ لے ضروری درو تے سپُن متن تہ جملہ نم درو<publicDomain>عوامی ڈومین</publicDomain> (cc0) عام کاڻ تی ڈیٹا سیٹ cc0 تہ لائسنس تہ تحت جاری کُریسن درو۔ صرف یہ صورتہ جملہ اپ لوڈ کُرا تے کیر میاکی مکمل طورہ یقین تھیو تے آں ہمیشہ متعلقہ حوالہ شامل کُرا۔

source: It is written in a language different than what I’m reviewing.
dml: ائی کیرا باڜہ جائزہ گینُم یہ تس تہ مختلف باڜہ لیکیسن درو

source: It is written in a language different than what I’m speaking.
dml: یہ ایک ورے باڜا لِکیسن درو کیرا باڜہ ائی پرینُم

source: It’s important to include citations so we can check that sentences are in the public domain and no copyright restriction apply.
dml: حوالہ نم شامل کُرن ضروری درو تہ ائی دڇھمہ تے جمل نم عوامی ڈومینہ دروئی آں کاپی رائٹ تہ کیہ بابندی لاگو تہ نی بیاں

source: It takes a lot to make Common Voice happen! We don't do it alone. Want to partner with us? We'd love to hear from you.
dml: عام کاڻ حقیقت ژوپنہ لے محنت پکار درو یہ ائی کیولے کُرین نی بئمہ۔ بی اما ملی شراکت کُری بئی? میاتہ یہ اُشتُرونی ائی کھوشن بُومہ۔

source: Izhorian
dml: ازہورین

source: Japanese
dml: جاپانی

source: Javanese
dml: جاوانی

source: Join the Common Voice mailing list
dml: کامن وائس تہ ای میل تہ لسٹہ شامل با

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
dml: بس یہ اشارہ تہ جواب کتکی قدرتی طورہ پرین بئیبہ ایک کتکی جملہ پریا، یہ باتی تاکید کُرا تے مینہ باݜہ معقول آں توہین امیز نی تِھیو۔

source: Just Unsure?
dml: غیر یقینی

source: Kabardian
dml: کبارڈین

source: Kabyle
dml: کابیل

source: Kalenjin
dml: کالنجن

source: Kannada
dml: کنادا

source: Kaqchikel
dml: ککیوچیکیل

source: Karakalpak
dml: قراقلپک

source: Kazakh
dml: قازق

source: { $kb }kb max
dml: { $kb }ک بی میکس

source: Keep
dml: ساتے

source: Keep it up, record again <recordIcon></recordIcon>
dml: اکی منے جاری ساتے، دوبارہ ریکاڈ کُرے<recordIcon></recordIcon>

source: Keep the recordings
dml: ریکارڈنگ تھئی

source: Keep track of your progress and metrics across multiple languages.
dml: لے باڜہ نامہ تانو پیش رفت آں میٹرکس ڜا نظر ساتا

source: Keep track of your progress with a profile
dml: پروفائل ملی تانوں پیش رفت ڜا نظر ساتے

source: Keep track of your progress with a profile and help our voice data be more accurate.
dml: پروفائل ملی تانوں پیش رفتہ نظر ساتا آں امونہ کاڻ تہ ڈیٹا سئی کُرنہ مدد کُرا۔

source: Kelabit
dml: کیلا بٹ

source: Kenyah
dml: کینیا

source: Khmer
dml: خمیر

source: Kichwa
dml: کیچوا

source: Kidaw'ida
dml: کِداوِدا

source: Kikuyu
dml: کیکیو

source: Kinyarwanda
dml: کنیارونڈا

source: Kom
dml: قوم

source: Komi-Zyrian
dml: کومی زائرین

source: Konkani (Devanagari)
dml: کونکنی(دیوناگری)

source: Korean
dml: کورین

source: Kurmanji Kurdish
dml: کرمانجی کرد

source: Kyrgyz
dml: کرغیز

source: Language
dml: باݜہ

source: Language Fundamentals (e.g. Digits, Letters, Money)
dml: باڜہ تہ بنیادی اصول(ہندسہ،حروف،پیسہ)

source: Language Request
dml: باݜہ تہ درخاس

source: Language request successfully submitted, thank you.
dml: باݜہ تہ درخاس کامیابیہ ݜا شئن گا، تاں میرہ بانی

source: Languages
dml: باڜہ نم

source: Languages can have their own validation rules with additional requirements when they localize. If there is no specific validation file for a language, the English rules will show for contributors.
dml: باݜہ نامہ ساں تانوں توثیق تہ ضوابط تِھنا۔ مقامی بین تہ وجہ اضافی ضروریات شامل بیب بیاں، اگر ایک باݜہ ساں مخصوص توثیق تہ فائل نی فدرو بہ تا انگریزی تہ قوائد شراکت دار کی ظاہر بو۔

source: Lao
dml: لاؤ

source: Large bulk sentence submission
dml: لے تعدادہ جملہ جمع کُرن

source: Large scale corporates and platform companies
dml: بلو سطح تہ کارپوریٹ نم آں پلٹ فام کمہنی نم

source: Last Updated: { $lastUpdatedTimeStamp }
dml: أخری اپ ڈیٹ: { $lastUpdatedTimeStamp }

source: Latgalian
dml: لٹگالیان

source: Latvian
dml: لیتوین

source: Launched
dml: لانچ کُرین گا

source: Laz
dml: لاز

source: Leaderboard Visibility
dml: لیڈربورڈ وزیبلٹی

source: Learn about partnerships with Common Voice
dml: شراکت تہ بارہ زانا عام کاڻہ ملی

source: Learn how to check a transcription
dml: نقل تہ جانچ کُرن تہ طریقہ ڇھیچا

source: Learn how to take part
dml: حصہ گین تہ طریقہ ڇِھیڇا

source: Learn how to transcribe
dml: نقل کُرین تہ طریقہ ڇھیچا

source: Learn how to use this page
dml: یہ پیج استعمل کُرن تہ طریقہ ڇھیچا

source: Learn More
dml: لے ڇھیڇا

source: Leaving now means you’ll lose your changes
dml: تاں یہ وعینہ تانوں چانس ختُم کُنپ

source: Leaving now means you'll lose your progress
dml: ژا وعین تہ مطلب یہ با تے تاں مُکھ بئیں ین تہ ضائع بو

source: Length
dml: دریگار

source: Let's Get Started
dml: آڅا تے شروع کُریمہ

source: Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
dml: کیرا باݜہ پرین ینا سے حروف سئی تھیبو۔مثل تہ طور “ж” اوروسی حروف تہجی تہ ایک لفظ درو مگر یہ انگریزیہ کیر ایس استعمل نی بیاں یہ تہ پرئی انگریزی تہ متنہ کیر ایس نی ژاپینا

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
dml: لبری تقریر تقریبا 1000 گھنٹہ تہ 16Khz مترال انگریزی تقریرساں ایک مجموعہ درو یہ LibriVox پروجیکٹ تہ مترال آڈیو بکس تہ گین ینا۔

source: License
dml: لائسنس

source: License: <licenseLink>CC-0</licenseLink>
dml: لائسنس<licenseLink>CC-0</licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
dml: لائسنس<licenseLink>{ $license }</licenseLink>

source: Ligurian
dml: لیگورین

source: Lingala
dml: لنگالا

source: Link Copied
dml: لنک کاپی با

source: Links to websites that can help us understand the language
dml: ویب سائٹ تہ لنک کیرا باݜہ زاننہ امونہ مدد کُرین بیاں

source: Listen
dml: اُشتُرونن

source: Listening
dml: اُشترونن

source: Listen options menu
dml: اختیارت تہ مینو اُشتُرونا

source: Listen-Queue
dml: ترتیبہ اُشتُرونن

source: Lithuanian
dml: لتھوانیائی

source: Loading…
dml: لوڈ بیاں

source: Loading sentences…
dml: جملہ نم اکہ سن

source: Localized
dml: مقامی

source: Log In
dml: لاگ ان

source: Login Identity
dml: لاگن تہ شناخت

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
dml: <loginLink>لاگین</loginLink>آں<loginLink>سائن اپ</loginLink>کی لے جملہ نم شامل کُرا

source: Log in or sign up to get started
dml: لاگِن یا سائن اپ کُرے شروع کُرعیں کی

source: Log In / Sign Up
dml: لاگن / سائن اپ

source: Log In / Sign Up with { $company } email
dml: لاگ اِن /سائن ان ملی{ $company } ای میل

source: Log Out
dml: لاگ آوٹ

source: Lojban
dml: لوجبن

source: Look for text where the copyright no longer applies - for example most books that were published before 1920
dml: منو متن دڇھا تے کیرا کاہی رائٹ لوگو نی بیاں، مثل تہ طورہ لے کِتب نم کیرا 1920 تہ پریبݜئیں چپ بیرو

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
dml: منوں ژانپِنا تے یہ باݜا اُشتُرُونئیں کی کیہ کلپ نی درو۔ ژا کیہ ریکارڈ کُری لین پُورَنہ امُنہ مدد کُرا

source: Luganda
dml: لوگنڈا

source: Luxembourgish
dml: لکسمبرگش

source: Macedonian
dml: مقدونیہ تہ

source: Mada
dml: مادا

source: Maithili
dml: میتھیلی

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
dml: مشکول بین تہ پرہݜبئں ابدے دڇھا تے پلٹ فام ریکاڈ کنو کو نی، آں کیر ختم با بہ بند بیائی

source: Make sure the sentence meets the following criteria:
dml: یقین کُرا تے جملہ مئیں معارنامہ پورا بیائی

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
dml: تا جمع کُریسن لے تہ لے جامع ژوپا، اچھک ویلیسن ڈیموگرافک ڈیٹا پرئی۔ ائی سپُن ڈیموگرافک ٹیٹا عام ماݜہ کی کڅن تہ پریݜبئیں تساں شناخت ختم کُنُمہ۔

source: Malagasy
dml: مالاگاسی

source: Malay
dml: مالائی

source: Malayalam
dml: ملیالم

source: Male/Masculine
dml: مچ/

source: Maltese
dml: مالٹیز

source: Manage Email Subscriptions
dml: ای میل سبسکریپشنز تہ انتظم کُرا

source: Manage Subscriptions
dml: سبسکریپشنز مینج کُرا

source: Marathi
dml: مراٹھی

source: <mark>Check</mark>
dml: <mark>چیک کُرا</mark>

source: <mark>Data</mark>
dml: <mark>ڈیٹا</mark>

source: <mark>Prompt</mark>
dml: <mark>پرامٹ</mark>

source: <mark>Respond</mark>
dml: <mark>جواب</mark>

source: <mark>Transcribe</mark>
dml: <mark>ٹرانسکرائب</mark>

source: <mark>Using CV for</mark><br/><mark>your research?</mark>
dml: <mark>سی وی استعمل کُرا تہ پرئی</mark><br/><mark> مینہ ریسرج</mark>

source: <mark>We need</mark><br/><mark>your help!</mark>
dml: <mark>اما کی پکار درو</mark><br/><mark> مینہ مدد</mark>

source: Maximum file size: 25 MB
dml: فائل ساں زیت تہ زیت سائز : 25 MB

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
dml: شاید امونہ<homepageLink>ہوم پیچ</homepageLink>مدد کُرو? سُول کرئیں کی ،مہربانی کُری شامل با<matrixLink> میٹرکس کمیونٹی جاٹ</matrixLink>،سائت تہ مسالہ نم تہ نگرانی کُرا<githubLink>یGitHub </githubLink>یا بہ دڇھا<discourseLink>امونہ مُشکُل فامز</discourseLink>

source: MB
dml: ایم بی MB

source: Mbo
dml: ایمبو

source: Meadow Mari
dml: میڈو ماری

source: Media and Entertainment
dml: میڈیا آں تفریح

source: Medumba
dml: میڈمبا

source: Meetei Lon
dml: میٹی لون

source: Message
dml: میسج

source: Michoacán Mazahua
dml: مچوآکان مازہوا

source: Minimum sentences in file: 1000
dml: ایک فائلہ کم از کم جملہ نم ۱۰۰۰

source: [Mismatched content]
dml: ایک سیکہ نی میلو بال مواد

source: Misreadings
dml: غلط مترن

source: Missing an 's' at the end of a word.
dml: لفظ تہ آخرہ 's' پُھس درو

source: Missing an <strong>'s'</strong> at the end of a word.
dml: پھو بئیسن <strong>'s'</strong> لفظ تہ آخرہ

source: Missing 'A' or 'The' at the beginning of the recording.
dml: ریکارڈنگ تہ شروع 'A' یا 'The' پُھس درو

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
dml: پھوس بئیسن <strong>'A'</strong> or <strong>'The'</strong> ریکارڈنگ تہ شروعہ

source: Missing the end of the last word by cutting off the recording too quickly.
dml: آخری لفظ تہ کنا وعین لے تیزیہ ریکارڈنگ کُرنہ

source: Mixed
dml: گٹ وٹ

source: Mokpwe
dml: موکپوے

source: Moksha
dml: موکشا

source: Mongolian
dml: منگول

source: More
dml: ورے

source: [More has been recorded than the required text]
dml: [پکار متن تہ زیت ریکارڈنگ کُرین گا]

source: More languages coming soon
dml: ورے باݜہ نم بھتائی آڅنا

source: Mossi
dml: موسی

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
dml: بلو کمپنی ساں زریعہ استعمل بال ڈیٹا زیت تر عام ماڜہ کی مہیہ نی تِھنا, امونہ یہ منن درو تے یہ جدت تہ پھنتہ روکاوٹ درو۔ لہذا ائی منصوبہ عام کاڻ شروع کُٹھومہ ۔ یہ کاڻ تہ زانن سپُنہ کی کولو ژوپنہ مدد کُرن تہ منصوبہ دروآں ہر کُرئی استعمل کُرین بئین

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
dml: بلو کمپنی ساں زریعہ استعمل بال ڈیٹا زیت تر عام ماڜہ کی نی تِھنا, امونہ یہ منن درو تے یہ جدت تہ پھنتہ روکاوٹ درو۔ لہذا ہم منصوبہ عام کاڻ شروع کُٹھومہ ۔ یہ کاڻ تہ زانن سپُنہ کی کولو ژوپنہ مدد کُرن تہ منصوبہ درو

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
dml: زیت تر ریکارڈنگ ما.ݜ ساں قدرتی کاڻہ مُشکُل بین تہ تِھنا۔ بی کیر منوغیر معیاری ریکارڈنگ ایس قبول کُرین بئیبہ، کیرا ڇنگ پرئی، چھئیہ یا بہ واضح طورہ ڈرامائی اندازہ کُریسن تھیو۔ مہربانی کُرئی آرا تہ ریکارڈنگ آں کمپیوٹر تہ مصنوعی طورہ ژوپئسن کاڻ تہ ریکارڈنگ مسترد کُرا۔

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
dml: موزیلا عام کاڻ سپُن تہ پریڜبئین ژوپائیسن درو۔ یہ مشین نم ساں مدد کُنا تے انسانان کنو بئی مُشکُل بِن

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
dml: موزیلا کامن وائس پورہ دنیا تہ کارکنان، باݜہ تہ ماہر،ڈیٹا تہ سائنسدانان،ماہری تعلیم،آں سافٹ وئیر انجنئیر ساں متنوع کمیونٹی یے ممکن کُتھین۔ یہ پرجیکٹ موزیلا فاونڈیشن ساں انتظم نیع درو۔

source: Mozilla Common Voice is the world’s most diverse crowdsourced open speech dataset - and we’re powered entirely by donations. It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. If you value open, inclusive data - <b>donate today!</b>
dml: موزیلا کامن وائس دنیا تہ سپُن تہ بلو کراوڈ سورسڈ اوپن تقریر تہ ڈیٹا سیٹ درو۔ آں یہ مکمل طورہ عطیہ چلنا۔ ڈیٹا سیٹ تہ میزبانی پلیٹ فام تہ بہتری باݜہ ایک ملین خرچہ آڅنا 100باݜہ تہ کمیونٹی اما ڜا انحصار کنُن۔ اگر میاکی جامع ڈیٹا تہ قدر درو بہ کولو کُرا<b>مُدئیں عطیہ کُرا</b>

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
dml: موزیلا ساں کولو زریہ کاڻ زانال انجن ڈیپ تقریر، تقریر زانال ایپلی کیشن ژوپئیں کُرین بئیبہ۔ مترا امونہ<githubLink>Github جائزہ</githubLink>آں شامل با<discourseLink> ڈیپ تقریر ڈسکورس</discourseLink> متریئں کی تہ کنو کی شروع کُریبہ

source: Mutual accountability.
dml: تانو من تہ احتسب

source: n
dml: این

source: N
dml: این

source: Name
dml: نم

source: Names of your language
dml: تاں باݜہ تہ نم نم

source: Native Language
dml: مقامی باݜہ

source: Nature and Environment
dml: فطرت آں ماحول

source: Need help with the Sex or Gender changes?
dml: سیکس یا جنس بدلنہ مدد پکار دورئی؟

source: Need some help with accent?
dml: لہجہ اچھک مدد پکار درو؟

source: Need some help with variants?
dml: ویرینٹ نامہ اچھک مدد پکار درو؟

source: Need to download your data?
dml: تاں ڈیٹا ڈاون لوڈ کُرن پکار درو?

source: Nepali
dml: نیپالی

source: New Language Launch
dml: نواں باݜہ تہ شروع کُرن

source: News and Current Affairs
dml: خبرونہ آں حالاتِ حاضرہ

source: Next
dml: پریڜبئیں

source: Ngiembon
dml: نگیمبون

source: Nias
dml: نیاس

source: Nigerian Pidgin English
dml: نیگرین پیڈگن انگریزی

source: No
dml: نی

source: [No ‘a’ in the original text]
dml: نی اصل متنہ ‘a’ نی درو

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
dml: <noCopyright> کاپی کُرن تہ اجازت نی درو</noCopyright> پابندی نم

source: No foreign letters
dml: غیر ملکی خط نم استعمل نی کُریبہ

source: No gravatar found for your email
dml: تاں ای میلہ گواٹار نی میلو با

source: No information
dml: معلومات نی درو

source: No information available
dml: معولومات نی درو

source: No microphone found.
dml: مائیکروفون میلو نی با

source: Non-binary
dml: غیر بائنری

source: No numbers and special characters
dml: نمبر آں خصوصی حروف استعمل نی کُریبہ

source: Northern Sotho
dml: شمالی سوتھو

source: Northwest Gbaya
dml: شمال مغربی گابا

source: Norwegian Bokmål
dml: نارویجن بوکمل

source: Norwegian Nynorsk
dml: نارویجن نینورسک

source: No sentences to review. <addLink>Add more sentences now!</addLink>
dml: جائزہ تہ پرئی ایک جملہ ایس نی درو<addLink> ژا ورے جملہ نم شامل کُرا </addLink>

source: ⓘ Not all sentences and clips have Variant tags yet!
dml: سپؙنجملہ نم آں کلپ نامہ ویریئنٹ تہ ٹیگ نی درو اژئی!

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
dml: نوٹ، کیر وزیبلہ سیٹ با یہ ؛یہ ترتیب <profileLink> پروفائل پھٹ تہ بدلئن بئیبہ</profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
dml: نوٹس: توکی شراکت تہ قسم بدل کُرئیں کی ژا ایس مُشکُل بین آں اُشتُرننہ منورہ انتخب کُرن بݜ درو۔

source: Not Found
dml: نی میلاو با

source: No Thanks
dml: نی مہرہ بانی ،نی شکریہ

source: No thanks, continue speaking
dml: نی مہربانی، مُشکُل بو

source: No variant selected
dml: ایک لجہ ایس سلیکٹ نی کوتھین

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
dml: ژا تو عام کاڻ تہ بارا لے زانپ، مساں ازمیخ کُریمہ مائی کروفون آئیکون ݜا کلک کُرے شورے جملہ نم مترئیں کی۔<br/> <br/>اگر بی ورے ماݜ ساں کاڻ تہ تعاون تہ جائزہ گین نہ ابُت زانبہ پلے آئیکون ݜا ککل کُرے۔ بی یہ باتی تہ تصدیق کُرنہ مدد کُریبہ تے ریکاڈنگ سکرینہ لیکیسن جملہ نم ملی میلو بیاں

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
dml: ژا بی اوپن سورس کاڻ تہ ڈیٹا بیس ژوپئیں کی تانوں کاڻ عطیہ کُری امونہ مدد کُرئیں کی۔آلات آں ویب تہ پرئی نواں ایپس نم ژوپئیں کی یہ ہر کُرئی استعمل کُرین بئین۔ ایک جملہ متری مشین نم ڇھڇئینہ مدد کُرا ساں تے حقیقی انسانان کنو بئی مُشکُل بِن۔ ورے ساں کرم چیک کُری کوالٹی ابُت کُرئیں ڜژی۔ یہ متکی اسکان درو

source: Number of Voices
dml: کاڻ نم تہ تعداد

source: Numbers
dml: نمبرنم

source: Occitan
dml: آکسیٹن

source: Odia
dml: اوڈیا

source: Off
dml: بند

source: Offensive Content
dml: جارحانہ مواد

source: Offensive language
dml: جارحانہ باڜہ

source: Offensive speech
dml: جارحانہ تقریر

source: Offline Sources
dml: آف لائن زریعہ نم

source: On
dml: کولؤ

source: On desktop devices you can contribute by downloading…
dml: ڈیسک ٹاپ ڈیوائسز نامہ بی ڈاون لوڈ کُری مدد کُرین بئیبہ

source: On his head he wore a beret.
dml: تساں باݜہ تنی بیرٹ بنتھے

source: On iOS please continue with Safari to enable recording…
dml: مہربانی کُری iOS سفاری ملی ریکاڈنگ قابل ژوپئیں کی جاری ساتا

source: Only show me sentences and clips from my variant
dml: موکی صرف ما ویریئنٹ تہ جملہ نم آں کلپ نم کڅئی

source: On the other hand, if you think that the reader has never come across the word before, and is making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
dml: دوئم طرفہ اگر بی ڇمائیہ بہ تے مترال کی یہ پریݜبئیں یہ لفظ نی اُشترُن تھے،آں سے تلفظہ غلط اندازہ لگایا، تہ مہربانی کُری یہ رد کُرا،اگر میاں کی یقین نی درو بہ اسکیپ بٹن استعمل کُرا۔

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
dml: اگر بئی ڇمائیہ بہ تے اُشتُرنال لے پریݜبئں یہ لفظ نی بیتھے آں مساں تلفظ تہ غلط اندازہ لگایاں، تا مسترد کُرا۔ اگر میاں کی شک درو بہ پھرکی سکپ بٹن استعمل کُرا۔

source: Open innovation is at the heart of what we do. For research collaborations, data collection or interviews, <emailFragment>reach out.</emailFragment>
dml: کولئوجدت امونہ زادیہ درو ائی کیہ کُنومہ بہ۔ ریسرج تہ تعاون،ٹیٹا جمع کُرن آں انٹریو تہ پرئی،<emailFragment>رابطہ کُرا۔</emailFragment>

source: Optionally join on our email list for updates and new information about the project.
dml: تانو مرضیہ امونہ ای میل تہ لسٹہ شامل با تے پروجیکٹ تہ بارہ تازہ معلومات آں اپ ڈیٹ حاصل کُریبہ

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
dml: تانو مرضیہ جمع کُریسن آبادیاتی ڈیٹا مثلا(عمر،جنس، باݜہ، لہجہ) تاں پروفائلہ کیر عوامی نی کُرین یو، آں ڈیٹا سیٹہ تاں اکاونٹ ملی شامل نی کُرین یو۔انفرادی آڈیو کلپ نم آبادیاتی ڈیٹا ملی لے بہتر تجزیہ کُرن تہ مقصدہ اکٹین یو۔ مثل تہ طورہ ایک محقق ایک مخصوص آبادیاتی سیگمنٹ تہ پرئی تربیتی ماڈل نشانہ ژوپایاں۔

source: Ossetian
dml: اوسیشین

source: Other
dml: ورے

source: Other Language
dml: ورے باݜہ

source: Other people validate those voice clips.
dml: ورے ماݜ تئں کاݩ تہ کلپ توثیق کنُن

source: Other voice datasets…
dml: ورے کاڻ تہ ڈیٹا سیٹ نم

source: Other Voice Datasets
dml: ورے کاڻ تہ ڈیٹا سیٹ نم

source: Our community manager will reach out to you to offer extra support, and to let you know if there is already a community working on your language
dml: امونہ کمیونٹی منیجر میاں ملی رابطہ کُرو تے اضافی مدد کُرو، یہ کُھڈئیں کی تے مینہ باݜہ پرݜبئی تہ کمیونٹی کرم کُنا

source: Our governance is founded on the pillars of:
dml: امونہ حکومت تہ بنیاد مے اُشتونہ درو

source: Our Partners
dml: امونہ شراکت دار
